{"dataset_id": 42665, "name": "ricci_vs_destefano", "version": 1, "description": "DESCRIPTIVE ABSTRACT:\nThe data set contains the oral, written and combined test scores for 2003 New Haven Fire Department \npromotion exams. The Race and Position for each test taker are also given. \n\n\nSOURCES:\nThe data was obtained from the district court's decision, the briefs and appendices to them. \n\nRicci v. DeStefeno, 554 F. Supp. 2d 142 (United States District Court for the district of Connecticut)\n\n\nVARIABLE DESCRIPTIONS:\n\nColumns \n1 Race -- W = white, H=Hispanic, B=black\n3-12 Position -- Captain or Lieutenant\n14-18 Oral -- Oral exam score\n20-21 Written -- Written exam score\n23-28 Combine -- Weighted total score, with 60% written and 40% oral\n\nValues are centered and delimited by blanks. There are no missing values.\n\nSTORY BEHIND THE DATA:\nIn November and December of 2003, the New Haven Fire Department administered oral and written exams \nfor promotion to Lieutenant and Captain. Under the contract between the City of New Haven and the \nfirefighter's union, the written exam received a weight of 60% and oral exam received a weight of 40%.\nApplicants with a total score of 70% or above pass the exam and become eligible for promotion. A total \nof 118 firefighters took the exam. Among them, 77 took the Lieutenant exam, and 41 took the Captain exam. \nDuring the time of the exams, there were 8 Lieutenant and 7 Captain positions available. The City Charter of\nNew Haven specifies that when &quot;g&quot; promotions are made, the Department must select them from the top\n&quot;g+2&quot; scorers. Consequently, top 10 Lieutenant scorers and top 9 Captain scorers are eligible for \npotential promotion. The City of New Haven decided not to certify the exam and promoted no one, \nbecause an insufficient number of minorities would receive a promotion to an existing position. \nRicci and other test-takers who would be considered for promotion had the city certified the exam \nsued the city for reverse discrimination. The District Court decided that the plaintiffs did not \nhave a viable disparate impact claim. The appeals court confirmed the district court's ruling in \nFeb, 2008. On June 29, 2009, the Supreme Court decided that the City's failure to certify the tests \nwas a violation of Title VII of the Civil Rights Act of 1964. \n\nPEDAGOGICAL NOTES:\nThere are three races in the data: white, Hispanic and black. The data can be used for one-way ANOVA on \nequality of average test scores for three races; two-way ANOVA for \nequlity of test scores for race and position; chi-square test on the equality \nof pass rates for three races; Fisher-Freeman-Halton test on the equality of the potential promotion \nrates.\n\nInstructors can also combine blacks and Hispanics as minority. Then the following analysis can be made: \ntwo-sample t-test on equality of average test scores for majority v. minority; chi-square test on the \nequality of pass rates for majority v. minority; Fisher's exact test on equality of the potential \npromotion rates for majority v.minority.\n\nData obtained from \nhttps://github.com/algofairness/fairness-comparison", "creator": "Weiwen Miao", "contributor": null, "collection_date": null, "upload_date": "2020-09-14T12:52:34", "language": null, "license": "CC0", "default_target_attribute": "Promotion", "row_id_attribute": null, "ignore_attribute": null, "tags": null, "features": [{"index": 0, "name": "Position", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 1, "name": "Oral", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 2, "name": "Written", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 3, "name": "Race", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 4, "name": "Combine", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 5, "name": "Promotion", "data_type": "string", "nominal_values": null, "number_missing_values": 0}], "qualities": {"AutoCorrelation": 1.0, "Dimensionality": 0.05084745762711865, "MajorityClassPercentage": 52.54237288135594, "MajorityClassSize": 62.0, "MinorityClassPercentage": 47.45762711864407, "MinorityClassSize": 56.0, "NumberOfBinaryFeatures": 0.0, "NumberOfClasses": 2.0, "NumberOfFeatures": 6.0, "NumberOfInstances": 118.0, "NumberOfInstancesWithMissingValues": 0.0, "NumberOfMissingValues": 0.0, "NumberOfNumericFeatures": 3.0, "NumberOfSymbolicFeatures": 0.0, "PercentageOfBinaryFeatures": 0.0, "PercentageOfInstancesWithMissingValues": 0.0, "PercentageOfMissingValues": 0.0, "PercentageOfNumericFeatures": 50.0, "PercentageOfSymbolicFeatures": 0.0}}