{"dataset_id": 43376, "name": "Al_Hilal-Archive-Scores", "version": 1, "description": "Context\nAs Al Hilal football club is one of the most successful football clubs in Saudi Arabia, Middle East and Asia this dataset was an excercise for Web Scraping where i collected the archive of the results for the club. The dataset inclues all matches from 1996 to 2019 and many important matches from 1961 to 1995. The source where the data has been scraped of is Koora website which is one of te oldest arabic websites that specilize in football news and matches scores. \nContent\nThe dataset includes home team column which contains the team that hosts the match, the away team who came to play against the home team,  and between them the score of the match. After that the date where the game has been played in, then the wining team from the match. the column before the last contains the competition which the game has been a part of and the last column is the stage of the competition of the game. \nin home and away columns when the game is played in local competition the name of the team is written without the name of the country, but when the game is played in an international competiton the name of the team is followed by the country of the team as there could be teams which has the same name but from different countries. \nAll column are object type except date column which is Datetime type. The dataset contains no null values except the stage column as the null value means that the match didn't have a stage such as friendly matches or the stage is not provided by the website \nAcknowledgements\nThanks to General Assembly  Misk Academy for the immersive data science course which taught many skills and methods one of which is Web Scraping that was used in this project. Thanks and apperciation goes to my instructors as they are always there for help and dedicate alot of time to ensure that all students master all skills. \nInspiration\nwhich years are the most successful ? \nwhich leagues the club scored the highest point ? \nwhat are the clubs that the Al Hilal won against the most and what are the teams that defated Al Hilal through the years ? \ncould there be a model to predict the result of the feature matches for Al Hilal ? \nwhich months Al Hilal win in the most and which that Al Hilal lose in it ? \nand many exploerations that cone be done.", "creator": null, "contributor": null, "collection_date": "19-03-2020", "upload_date": "2022-03-23T12:44:01", "language": "English", "license": "CC0: Public Domain", "default_target_attribute": null, "row_id_attribute": null, "ignore_attribute": null, "tags": null, "features": [{"index": 0, "name": "Unnamed:_0", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 1, "name": "home_team", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 2, "name": "scores", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 3, "name": "away_team", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 4, "name": "date", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 5, "name": "wining_team", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 6, "name": "competiton", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 7, "name": "stage", "data_type": "string", "nominal_values": null, "number_missing_values": 219}], "qualities": {"AutoCorrelation": NaN, "Dimensionality": 0.00586940572267058, "MajorityClassPercentage": NaN, "MajorityClassSize": NaN, "MinorityClassPercentage": NaN, "MinorityClassSize": NaN, "NumberOfBinaryFeatures": 0.0, "NumberOfClasses": NaN, "NumberOfFeatures": 8.0, "NumberOfInstances": 1363.0, "NumberOfInstancesWithMissingValues": 219.0, "NumberOfMissingValues": 219.0, "NumberOfNumericFeatures": 1.0, "NumberOfSymbolicFeatures": 0.0, "PercentageOfBinaryFeatures": 0.0, "PercentageOfInstancesWithMissingValues": 16.06749816581071, "PercentageOfMissingValues": 2.008437270726339, "PercentageOfNumericFeatures": 12.5, "PercentageOfSymbolicFeatures": 0.0}}