{"dataset_id": 43467, "name": "National-Hockey-League-Interviews", "version": 1, "description": "Context\nThis dataset was scraped from http://www.asapsports.com/, using the code in this repository. I designed the webscraping code to account for most of the variance in the website's formatting, but some webpages with formatting that differed significantly were ignored. While manually inspecting random rows of the dataset I did not notice any glaring errors in the transcripts, but I cannot guarantee that there aren't any. \nContent\nRowId: A unique row identifier\nteam1 and team2: The two teams in the Stanley Cup Final. Whether a team is team1 or team2 has no meaning: it's determined by the order of their listing on the website.\ndate: The date of the interview\nname: The person being interviewed\njob: Takes values \"player\", \"coach\", and \"other\". If they are a player or coach at the time of the interview they are assigned accordingly. Otherwise they are assigned \"other\". Most of the people in the \"other\" category are general managers, league officials, and commentators. Some of these values were assigned automatically based on their title in a transcript (e.g. \"Coach Mike Babcock\"), and others were assigned manually. A possible source of error is the fact that I did not manually inspect names that appeared only once. \ntext: The interview transcript. Interviewer questions were not collected, so all of the speech comes from the interviewee. Responses to questions are separated by periods. These periods will be the only punctuation in the text. Note that a likely source of error in this column is a failure to ignore an interviewer's questions. \nRelated Links\nIn other work I used this dataset to train an RNN-based Facebook Messenger chatbot to respond to messages as a hockey player might. More precisely, if you send the bot the beginning of an interview response, it will respond with a 5-sentence continuation of that response. For example, it could receive \"Well you know\" and respond with \"Well you know we played hard out there and\". Follow this link to interact with the chatbot and this link to read the Medium article where I explain how I created the bot.\nAcknowledgements\nThe idea to scrape interviews from ASAPSports came from this article by Mathieu Bray.\nInspiration\n\nHow do speech patterns of NHL coaches and players differ? Are coaches more positive than players? More team oriented?\nHow have hockey interview responses changed over the years?\nCan we create a bot that talks like an NHL player? (See Related Links)", "creator": null, "contributor": null, "collection_date": "22-03-2020", "upload_date": "2022-03-23T13:24:02", "language": "English", "license": "CC0: Public Domain", "default_target_attribute": null, "row_id_attribute": null, "ignore_attribute": ["RowId"], "tags": null, "features": [{"index": 0, "name": "RowId", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 1, "name": "team1", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 2, "name": "team2", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 3, "name": "date", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 4, "name": "name", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 5, "name": "job", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 6, "name": "text", "data_type": "string", "nominal_values": null, "number_missing_values": 0}], "qualities": {"AutoCorrelation": NaN, "Dimensionality": 0.0028625954198473282, "MajorityClassPercentage": NaN, "MajorityClassSize": NaN, "MinorityClassPercentage": NaN, "MinorityClassSize": NaN, "NumberOfBinaryFeatures": 0.0, "NumberOfClasses": NaN, "NumberOfFeatures": 6.0, "NumberOfInstances": 2096.0, "NumberOfInstancesWithMissingValues": 0.0, "NumberOfMissingValues": 0.0, "NumberOfNumericFeatures": 0.0, "NumberOfSymbolicFeatures": 0.0, "PercentageOfBinaryFeatures": 0.0, "PercentageOfInstancesWithMissingValues": 0.0, "PercentageOfMissingValues": 0.0, "PercentageOfNumericFeatures": 0.0, "PercentageOfSymbolicFeatures": 0.0}}