{"dataset_id": 43537, "name": "AMD-Stock-Prices-Historical-Data", "version": 1, "description": "Context\nAdvanced Micro Devices, Inc. operates as a semiconductor company worldwide. The company operates in two segments, Computing and Graphics; and Enterprise, Embedded and Semi-Custom. Its products include x86 microprocessors as an accelerated processing unit, chipsets, discrete and integrated graphics processing units (GPUs), data center and professional GPUs, and development services; and server and embedded processors, and semi-custom System-on-Chip (SoC) products, development services, and technology for game consoles. The company provides x86 microprocessors for desktop PCs under the AMD Ryzen, AMD Ryzen PRO, Ryzen, Threadripper, AMD A-Series, AMD FX, AMD Athlon, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for notebook and 2-in-1s under the AMD Ryzen processors with Radeon Vega GPUs, AMD A-Series, AMD Athlon, AMD Ryzen PRO, and AMD Pro A-Series processors brands; microprocessors for servers under the AMD EPYC and AMD Opteron brands; and chipsets under the AMD trademark. It also offers discrete GPUs for desktop and notebook PCs under the AMD Radeon graphics and AMD Embedded Radeon brands; professional graphics products under the AMD Radeon Pro and AMD FirePro graphics brands; and Radeon Instinct accelerators for servers. In addition, the company provides embedded processor solutions for interactive digital signage, casino gaming, and medical imaging under the AMD Opteron, AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series processors brands; and customer-specific solutions based on AMD CPU, GPU, and multi-media technologies, as well as semi-custom SoC products. It serves original equipment and design manufacturers, datacenters, original design manufacturers, system integrators, independent distributors, online retailers, and add-in-board manufacturers through its direct sales force, independent distributors, and sales representatives. The company was founded in 1969 and is headquartered in Santa Clara, California.\nContent\nWhat's inside is more than just rows and columns. Make it easy for others to get started by describing how you acquired the data and what time period it represents, too.\nimport yfinance as yf  \ndf = yf.download(tickers=\"AMD\")  \ndf.to_csv('AMD.csv')\n\nAcknowledgements\nThis data collected with one line code using yahoo finance and yfinance library.", "creator": null, "contributor": null, "collection_date": "25-02-2021", "upload_date": "2022-03-23T13:45:37", "language": "English", "license": "CC BY-SA 4.0", "default_target_attribute": null, "row_id_attribute": null, "ignore_attribute": null, "tags": null, "features": [{"index": 0, "name": "Date", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 1, "name": "Open", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 2, "name": "High", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 3, "name": "Low", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 4, "name": "Close", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 5, "name": "Adj_Close", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 6, "name": "Volume", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}], "qualities": {"AutoCorrelation": NaN, "Dimensionality": 0.0006756104623105878, "MajorityClassPercentage": NaN, "MajorityClassSize": NaN, "MinorityClassPercentage": NaN, "MinorityClassSize": NaN, "NumberOfBinaryFeatures": 0.0, "NumberOfClasses": NaN, "NumberOfFeatures": 7.0, "NumberOfInstances": 10361.0, "NumberOfInstancesWithMissingValues": 0.0, "NumberOfMissingValues": 0.0, "NumberOfNumericFeatures": 6.0, "NumberOfSymbolicFeatures": 0.0, "PercentageOfBinaryFeatures": 0.0, "PercentageOfInstancesWithMissingValues": 0.0, "PercentageOfMissingValues": 0.0, "PercentageOfNumericFeatures": 85.71428571428571, "PercentageOfSymbolicFeatures": 0.0}}