{"dataset_id": 43560, "name": "World-of-Warcraft-auction-house-data", "version": 1, "description": "What is World of Wacraft?\nAccording to Wikipedia:\n\n  World of Warcraft (WoW) is a massively multiplayer online role-playing game (MMORPG) released in 2004 by Blizzard Entertainment. It is the fourth released game set in the Warcraft fantasy universe. World of Warcraft takes place within the Warcraft world of Azeroth, approximately four years after the events at the conclusion of Blizzard's previous Warcraft release, Warcraft III: The Frozen Throne. The game was announced in 2001, and was released for the 10th anniversary of the Warcraft franchise on November 23, 2004. Since launch, World of Warcraft has had eight major expansion packs produced for it: The Burning Crusade, Wrath of the Lich King, Cataclysm, Mists of Pandaria, Warlords of Draenor, Legion, Battle for Azeroth and Shadowlands.\n  World of Warcraft was the world's most popular MMORPG by player count of nearly 10 million in 2009. The game had a total of over a hundred million registered accounts by 2014. By 2017, the game had grossed over 9.23 billion in revenue, making it one of the highest-grossing video game franchises of all time. At BlizzCon 2017, a vanilla version of the game titled World of Warcraft Classic was announced, which planned to provide a way to experience the base game before any of its expansions launched. It was released in August 2019.\n\nWhy is it worth investigating?\nThe game World of Warcraft has already been a gold mine when it comes to scientific work (see google scholar). From social studies to finance, the world created by Blizzard has given many information about how players behave with their created characters, modelling how they act in real life. In this notebook, I will explore the auction house prices driven by demand over a few months for raid supplies.\nWhat is the meaning of all those strange words?\nWorld of Wacraft as any other game has specific terminology for items that are present in the world. Here is a summary of the specific items and words that will be used while researching this notebook.\n\nPvE - Player versus Environment, gameplay that focuses on fighting computer generated enemies,\nPvP - Player versus Player, gameplay that focuses on fighting other players,\nParty - A group of 2-5 players, created for participating in PvE or PvP scenarios,\nRaid Group - A group of 6-40 players divided in groups of 5, created for participating in PvE or PvP scenarios,\nRaid - An instanced dungeon, with several bosses that, proves a challenge for a raid group,\nFlask - One hour character stats buff that persists through death,\nPotion - A short boost to stats, that increases damage, survivability etc,\nFood - Long character stats buff that dissapears on death,\nFeast - A table that provides food buffs, but can be used by multiple people in a group.\nMoney - The amount of money you have. It's divided into gold, silver and copper:\n100 copper = 1 silver,\n100 silver = 1 gold.\nAuction House (AH) - Place where people sell their goods in-game.", "creator": null, "contributor": null, "collection_date": "09-06-2020", "upload_date": "2022-03-23T13:51:13", "language": "English", "license": "CC0: Public Domain", "default_target_attribute": null, "row_id_attribute": null, "ignore_attribute": null, "tags": null, "features": [{"index": 0, "name": "Name", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 1, "name": "Attributes", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 2, "name": "Sub-Types", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 3, "name": "Level", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 4, "name": "Attack_Points", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 5, "name": "Defense_Points", "data_type": "string", "nominal_values": null, "number_missing_values": 1}], "qualities": {"AutoCorrelation": NaN, "Dimensionality": 0.012552301255230125, "MajorityClassPercentage": NaN, "MajorityClassSize": NaN, "MinorityClassPercentage": NaN, "MinorityClassSize": NaN, "NumberOfBinaryFeatures": 0.0, "NumberOfClasses": NaN, "NumberOfFeatures": 6.0, "NumberOfInstances": 478.0, "NumberOfInstancesWithMissingValues": 1.0, "NumberOfMissingValues": 1.0, "NumberOfNumericFeatures": 1.0, "NumberOfSymbolicFeatures": 0.0, "PercentageOfBinaryFeatures": 0.0, "PercentageOfInstancesWithMissingValues": 0.20920502092050208, "PercentageOfMissingValues": 0.03486750348675035, "PercentageOfNumericFeatures": 16.666666666666664, "PercentageOfSymbolicFeatures": 0.0}}