{"dataset_id": 43642, "name": "Plz-predict-these-disasters-to-save-lives-around.", "version": 1, "description": "Context\nAs a community of responsible people can we focus to predict these disasters to save lives around. People are already going through worse as if that was not enough if a sudden earthquake comes up it becomes hell for them.\nThe United States Geological Survey (USGS) determines the location and size of all significant earthquakes that occur in US.The USGS provides science about the natural hazards that threaten lives and livelihoods; the water, energy, minerals, and other natural resources we rely on; the health of our ecosystems and environment; and the impacts of climate and land-use change.\nEstablished: 1879 Location: Reston, United St\nContent\ntime     latitude    longitude   depth   mag magType nst gap dmin    rms net id  updated place   type    horizontalError depthError  magError    magNst  status  locationSource  magSource\n1.)time\nData Type-Long Integer\nThe time when the event occurred. Times are reported in milliseconds since the epoch ( 1970-01-01T00:00:00.000Z), and do not include leap seconds. In certain output formats, the date is formatted for readability.(We provide time in UTC (Coordinated Universal Time). Seismologists use UTC to avoid confusion caused by local time zones and daylight savings time.)\nAdditional Information\n2.)latitude\nData Type-Decimal\nTypical Values-[-90.0, 90.0]\nDecimal degrees latitude. Negative values for southern latitudes.\nAdditional Information\nAn earthquake begins to rupture at a hypocenter which is defined by a position on the surface of the earth (epicenter) and a depth below this point (focal depth). We provide the coordinates of the epicenter in units of latitude and longitude. The latitude is the number of degrees north (N) or south (S) of the equator and varies from 0 at the equator to 90 at the poles. The longitude is the number of degrees east (E) or west (W) of the prime meridian which runs through Greenwich, England. The longitude varies from 0 at Greenwich to 180 and the E or W shows the direction from Greenwich. Coordinates are given in the WGS84 reference frame. The position uncertainty of the hypocenter location varies from about 100 m horizontally and 300 meters vertically for the best located events, those in the middle of densely spaced seismograph networks, to 10s of kilometers for global events in many parts of the world.\n3.)longitude\nData Type-Decimal\nTypical Values-[-180.0, 180.0]\nDescription-Decimal degrees longitude. Negative values for western longitudes.\nAdditional Information\nAn earthquake begins to rupture at a hypocenter which is defined by a position on the surface of the earth (epicenter) and a depth below this point (focal depth). We provide the coordinates of the epicenter in units of latitude and longitude. The latitude is the number of degrees north (N) or south (S) of the equator and varies from 0 at the equator to 90 at the poles. The longitude is the number of degrees east (E) or west (W) of the prime meridian which runs through Greenwich, England. The longitude varies from 0 at Greenwich to 180 and the E or W shows the direction from Greenwich. Coordinates are given in the WGS84 reference frame. The position uncertainty of the hypocenter location varies from about 100 m horizontally and 300 meters vertically for the best located events, those in the middle of densely spaced seismograph networks, to 10s of kilometers for global events in many parts of the world.\n4.)depth\nData Type-Decimal\nTypical Values-[0, 1000]\nDepth of the event in kilometers.\nAdditional Information\nSometimes when depth is poorly constrained by available seismic data, the location program will set the depth at a fixed value. For example, 33 km is often used as a default depth for earthquakes determined to be shallow, but whose depth is not satisfactorily determined by the data, whereas default depths of 5 or 10 km are often used in mid-continental areas and on mid-ocean ridges since earthquakes in these areas are usually shallower than 33 km.\n5.)mag\nData Type-Decimal\nTypical Values-[-1.0, 10.0]\nDescription-The magnitude for the event. See also magType.\nAdditional Info\n6.)magType\nData Type-String\nTypical Values-Md, Ml, Ms, Mw, Me, Mi, Mb, MLg\nThe method or algorithm used to calculate the preferred magnitude for the event.\nAdditional Information\nSee Magnitude Types Table.\n7.)nst\nData Type-Integer\nThe total number of seismic stations used to determine earthquake location.\nAdditional Information\nNumber of seismic stations which reported P- and S-arrival times for this earthquake. This number may be larger than the Number of Phases Used if arrival times are rejected because the distance to a seismic station exceeds the maximum allowable distance or because the arrival-time observation is inconsistent with the solution.\n8.)gap\nData Type-Decimal\nTypical Values-[0.0, 180.0]\nThe largest azimuthal gap between azimuthally adjacent stations (in degrees). In general, the smaller this number, the more reliable is the calculated horizontal position of the earthquake. Earthquake locations in which the azimuthal gap exceeds 180 degrees typically have large location and depth uncertainties.\n9.)dmin\nData Type-Decimal\nTypical Values-[0.4, 7.1]\nHorizontal dis distance from the epicentre to the nearest station (in degrees). 1 degree is approximately 111.2 kilometers. In general, the smaller this number, the more reliable is the calculated depth of the earthquake.\n10.)rms\nData Type-Decimal\nTypical Values-[0.13,1.39]\nThe root-mean-square (RMS) travel time residual, in sec, using all weights. This parameter provides a measure of the fit of the observed arrival times to the predicted arrival times for this location. Smaller numbers reflect a better fit of the data. The value is dependent on the accuracy of the velocity model used to compute the earthquake location, the quality weights assigned to the arrival time data, and the procedure used to locate the earthquake.\n11.)net\nData Type-String\nTypical Values-ak, at, ci, hv, ld, mb, nc, nm, nn, pr, pt, se, us, uu, uw\nThe ID of a data contributor. Identifies the network considered to be the preferred source of information for this event.\n12.)id\nData Type-String\nTypical Values-A (generally) two-character network identifier with a (generally) eight-character network-assigned code.\nA unique identifier for the event. This is the current preferred id for the event, and may change over time. See the \"ids\" GeoJSON format property.\n13.)updated\nData Type-Long Integer\nTime when the event was most recently updated. Times are reported in milliseconds since the epoch. In certain output formats, the date is formatted for readability.\n14.)place\nData Type-String\nTextual description of named geographic region near to the event.\n15.)type\nData Type-String\nTypical Values-earthquake, quarry\nType of seisseismic event.\n16.)horizontalError\nData Type-Decimal\nTypical Values-[0, 100]\nUncertainty of reported location of the event in kilometers.\nAdditional Information\nThe horizontal location error, in km, defined as the length of the largest projection of the three principal errors on a horizontal plane. The principal errors are the major axes of the error ellipsoid and are mutually perpendicular. The horizontal and vertical uncertainties in an event's location varie from about 100 m horizontally and 300 meters vertically for the best-located events, those in the middle of densely spaced seismograph networks, to 10s of kilometers  for global events in many parts of the world. We report an \"unknown\" value if the contributing seismic network does not supply uncertainty estimates.\n17.)depthError\nData Type-Decimal\nTypical Values-[0, 100]\nUncertainty of reported depth of the event in kilometers.\nAdditional Information\nThe depth error, in km, defined as the largest projection of the three principal errors on a vertical line.\n18.)magError\nData Type-Decimal\nTypical Values-[0, 100]\nUncertainty of reported magnitude of the event. The estimated standard error of the magnitude. The uncertainty corresponds to the specific magnitude type being reported and does not take into account magnitude variations and biases between different magnitude scales. We report an \"unknown\" value if the contributing seismic network does not supply uncertainty estimates.\n19.)magNst\nData Type-Integer\nThe total number of seismic stations used to calculate the magnitude for this earthquake.\n20.)status\nData Type-String\nTypical Values-automatic, reviewed, deleted\nIndicates whether the event has been reviewed by a human.\nAdditional Information\nStatus is either automatic or reviewed. Automatic events are directly posted by automatic processing systems and have not been verified or altered by a human. Reviewed events have been looked at by a human. The level of review can range from a quick validity check to a careful reanalysis of the event.\n21.)locationSource\nData Type-String\nTypical Values-(ak, at, ci, hv, ld, mb, nc, nm, nn, pr, pt, se, us, uu, uw)\nThe network that originally authored the reported location of this event.\n22.)magSource\nData Type-String\nTypical Values-(ak, at, ci, hv, ld, mb, nc, nm, nn, pr, pt, se, us, uu, uw)\nThe network that originally authored the reported magnitude for this event.\nInspiration\nWe are facing all kinds of disasters in this year 2020.Can we join as community and work towards atlest getting some predication from this dataset that contains many important factors and inspire the people by sharing the possibility of Data Science as a community.", "creator": null, "contributor": null, "collection_date": "29-08-2020", "upload_date": "2022-03-24T00:57:39", "language": "English", "license": "CC0: Public Domain", "default_target_attribute": null, "row_id_attribute": null, "ignore_attribute": null, "tags": null, "features": [{"index": 0, "name": "time", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 1, "name": "latitude", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 2, "name": "longitude", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 3, "name": "depth", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 4, "name": "mag", "data_type": "numeric", "nominal_values": null, "number_missing_values": 1}, {"index": 5, "name": "magType", "data_type": "string", "nominal_values": null, "number_missing_values": 1}, {"index": 6, "name": "nst", "data_type": "numeric", "nominal_values": null, "number_missing_values": 4061}, {"index": 7, "name": "gap", "data_type": "numeric", "nominal_values": null, "number_missing_values": 2976}, {"index": 8, "name": "dmin", "data_type": "numeric", "nominal_values": null, "number_missing_values": 4107}, {"index": 9, "name": "rms", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 10, "name": "net", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 11, "name": "id", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 12, "name": "updated", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 13, "name": "place", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 14, "name": "type", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 15, "name": "horizontalError", "data_type": "numeric", "nominal_values": null, "number_missing_values": 5385}, {"index": 16, "name": "depthError", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 17, "name": "magError", "data_type": "numeric", "nominal_values": null, "number_missing_values": 4831}, {"index": 18, "name": "magNst", "data_type": "numeric", "nominal_values": null, "number_missing_values": 4507}, {"index": 19, "name": "status", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 20, "name": "locationSource", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 21, "name": "magSource", "data_type": "string", "nominal_values": null, "number_missing_values": 0}], "qualities": {"AutoCorrelation": NaN, "Dimensionality": 0.001602447374171462, "MajorityClassPercentage": NaN, "MajorityClassSize": NaN, "MinorityClassPercentage": NaN, "MinorityClassSize": NaN, "NumberOfBinaryFeatures": 0.0, "NumberOfClasses": NaN, "NumberOfFeatures": 22.0, "NumberOfInstances": 13729.0, "NumberOfInstancesWithMissingValues": 7919.0, "NumberOfMissingValues": 25869.0, "NumberOfNumericFeatures": 12.0, "NumberOfSymbolicFeatures": 0.0, "PercentageOfBinaryFeatures": 0.0, "PercentageOfInstancesWithMissingValues": 57.680821618471846, "PercentageOfMissingValues": 8.56481634761189, "PercentageOfNumericFeatures": 54.54545454545454, "PercentageOfSymbolicFeatures": 0.0}}