{"dataset_id": 43715, "name": "Federal-Reserve-Interest-Rates-1954-Present", "version": 1, "description": "Context\nThe Federal Reserve sets interest rates to promote conditions that achieve the mandate set by the Congress  high employment, low and stable inflation, sustainable economic growth, and moderate long-term interest rates. Interest rates set by the Fed directly influence the cost of borrowing money. Lower interest rates encourage more people to obtain a mortgage for a new home or to borrow money for an automobile or for home improvement. Lower rates encourage businesses to borrow funds to invest in expansion such as purchasing new equipment, updating plants, or hiring more workers. Higher interest rates restrain such borrowing by consumers and businesses. \nContent\nThis dataset includes data on the economic conditions in the United States on a monthly basis since 1954. The federal funds rate is the interest rate at which depository institutions trade federal funds (balances held at Federal Reserve Banks) with each other overnight. The rate that the borrowing institution pays to the lending institution is determined between the two banks; the weighted average rate for all of these types of negotiations is called the effective federal funds rate. The effective federal funds rate is determined by the market but is influenced by the Federal Reserve through open market operations to reach the federal funds rate target. The Federal Open Market Committee (FOMC) meets eight times a year to determine the federal funds target rate; the target rate transitioned to a target range with an upper and lower limit in December 2008. The real gross domestic product is calculated as the seasonally adjusted quarterly rate of change in the gross domestic product based on chained 2009 dollars. The unemployment rate represents the number of unemployed as a seasonally adjusted percentage of the labor force. The inflation rate reflects the monthly change in the Consumer Price Index of products excluding food and energy.\nAcknowledgements\nThe interest rate data was published by the Federal Reserve Bank of St. Louis' economic data portal. The gross domestic product data was provided by the US Bureau of Economic Analysis; the unemployment and consumer price index data was provided by the US Bureau of Labor Statistics.\nInspiration\nHow does economic growth, unemployment, and inflation impact the Federal Reserve's interest rates decisions? How has the interest rate policy changed over time? Can you predict the Federal Reserve's next decision? Will the target range set in March 2017 be increased, decreased, or remain the same?", "creator": null, "contributor": null, "collection_date": "16-03-2017", "upload_date": "2022-03-24T07:31:42", "language": "English", "license": "CC0: Public Domain", "default_target_attribute": null, "row_id_attribute": null, "ignore_attribute": null, "tags": null, "features": [{"index": 0, "name": "Year", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 1, "name": "Month", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 2, "name": "Day", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 3, "name": "Federal_Funds_Target_Rate", "data_type": "numeric", "nominal_values": null, "number_missing_values": 442}, {"index": 4, "name": "Federal_Funds_Upper_Target", "data_type": "numeric", "nominal_values": null, "number_missing_values": 801}, {"index": 5, "name": "Federal_Funds_Lower_Target", "data_type": "numeric", "nominal_values": null, "number_missing_values": 801}, {"index": 6, "name": "Effective_Federal_Funds_Rate", "data_type": "numeric", "nominal_values": null, "number_missing_values": 152}, {"index": 7, "name": "Real_GDP_(Percent_Change)", "data_type": "numeric", "nominal_values": null, "number_missing_values": 654}, {"index": 8, "name": "Unemployment_Rate", "data_type": "numeric", "nominal_values": null, "number_missing_values": 152}, {"index": 9, "name": "Inflation_Rate", "data_type": "numeric", "nominal_values": null, "number_missing_values": 194}], "qualities": {"AutoCorrelation": NaN, "Dimensionality": 0.011061946902654867, "MajorityClassPercentage": NaN, "MajorityClassSize": NaN, "MinorityClassPercentage": NaN, "MinorityClassSize": NaN, "NumberOfBinaryFeatures": 0.0, "NumberOfClasses": NaN, "NumberOfFeatures": 10.0, "NumberOfInstances": 904.0, "NumberOfInstancesWithMissingValues": 904.0, "NumberOfMissingValues": 3196.0, "NumberOfNumericFeatures": 10.0, "NumberOfSymbolicFeatures": 0.0, "PercentageOfBinaryFeatures": 0.0, "PercentageOfInstancesWithMissingValues": 100.0, "PercentageOfMissingValues": 35.35398230088496, "PercentageOfNumericFeatures": 100.0, "PercentageOfSymbolicFeatures": 0.0}}