{"dataset_id": 43777, "name": "International-football-results", "version": 2, "description": "Context\nWell, what happened was that I was looking for a semi-definite easy-to-read list of international football matches and couldn't find anything decent. So I took it upon myself to collect it for my own use. I might as well share it.\nContent\nThis dataset includes 41,586 results of international football matches starting from the very first official match in 1972 up to 2019. The matches range from FIFA World Cup to FIFI Wild Cup to regular friendly matches. The matches are strictly men's full internationals and the data does not include Olympic Games or matches where at least one of the teams was the nation's B-team, U-23 or a league select team.\nresults.csv includes the following columns:\ndate - date of the match\nhometeam - the name of the home team\nawayteam - the name of the away team\nhomescore - full-time home team score including extra time, not including penalty-shootouts\nawayscore - full-time away team score including extra time, not including penalty-shootouts\ntournament - the name of the tournament\ncity - the name of the city/town/administrative unit where the match was played\ncountry - the name of the country where the match was played\nneutral - TRUE/FALSE column indicating whether the match was played at a neutral venue\nNote on team and country names:\nFor home and away teams the current name of the team has been used. For example, when in 1882 a team who called themselves Ireland played against England, in this dataset, it is called Northern Ireland because the current team of Northern Ireland is the successor of the 1882 Ireland team. This is done so it is easier to track the history and statistics of teams.\nFor country names, the name of the country at the time of the match is used. So when Ghana played in Accra, Gold Coast in the 1950s, even though the names of the home team and the country don't match, it was a home match for Ghana. This is indicated by the neutral column, which says FALSE for those matches, meaning it was not at a neutral venue.\nAcknowledgements\nThe data is gathered from several sources including but not limited to Wikipedia, fifa.com, rsssf.com and individual football associations' websites.\nInspiration\nSome directions to take when exploring the data:\nWho is the best team of all time\nWhich teams dominated different eras of football\nWhat trends have there been in international football throughout the ages - home advantage, total goals scored, distribution of teams' strength etc\nCan we say anything about geopolitics from football fixtures - how has the number of countries changed, which teams like to play each other\nWhich countries host the most matches where they themselves are not participating in\nHow much, if at all, does hosting a major tournament help a country's chances in the tournament\nWhich teams are the most active in playing friendlies and friendly tournaments - does it help or hurt them\nThe world's your oyster, my friend.\nContribute\nIf you notice a mistake or the results are being updated fast enough for your liking, you can fix that by submitting a pull request.", "creator": null, "contributor": null, "collection_date": "05-08-2020", "upload_date": "2022-03-24T10:25:59", "language": "English", "license": "CC0: Public Domain", "default_target_attribute": null, "row_id_attribute": null, "ignore_attribute": null, "tags": null, "features": [{"index": 0, "name": "date", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 1, "name": "home_team", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 2, "name": "away_team", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 3, "name": "home_score", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 4, "name": "away_score", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 5, "name": "tournament", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 6, "name": "city", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 7, "name": "country", "data_type": "string", "nominal_values": null, "number_missing_values": 0}, {"index": 8, "name": "neutral", "data_type": "nominal", "nominal_values": ["True", "False"], "number_missing_values": 0}], "qualities": {"AutoCorrelation": NaN, "Dimensionality": 0.0002164189871591401, "MajorityClassPercentage": NaN, "MajorityClassSize": NaN, "MinorityClassPercentage": NaN, "MinorityClassSize": NaN, "NumberOfBinaryFeatures": 1.0, "NumberOfClasses": NaN, "NumberOfFeatures": 9.0, "NumberOfInstances": 41586.0, "NumberOfInstancesWithMissingValues": 0.0, "NumberOfMissingValues": 0.0, "NumberOfNumericFeatures": 2.0, "NumberOfSymbolicFeatures": 1.0, "PercentageOfBinaryFeatures": 11.11111111111111, "PercentageOfInstancesWithMissingValues": 0.0, "PercentageOfMissingValues": 0.0, "PercentageOfNumericFeatures": 22.22222222222222, "PercentageOfSymbolicFeatures": 11.11111111111111}}