{"dataset_id": 563, "name": "kdd_el_nino-small", "version": 1, "description": "**Author**:   \n**Source**: Unknown - Date unknown  \n**Please cite**:   \n\nEl Nino Data\n\nData Type\n\nspatio-temporal\n\nAbstract\n\nThe data set contains oceanographic and surface meteorological\nreadings taken from a series of buoys positioned throughout the\nequatorial Pacific. The data is expected to aid in the understanding\nand prediction of El Nino/Southern Oscillation (ENSO) cycles.\n\nSources\n\nOriginal Owner\n\n[1]Pacific Marine Environmental Laboratory\nNational Oceanic and Atmospheric Administration\nUS Department of Commerce\n\nDonor\n\n[2]Dr Di Cook\nDepartment of Statistics\nIowa State University\n[3]dicook@iastate.edu\n\nDate Donated: June 30, 1999\n\nData Characteristics\n\nThis data was collected with the Tropical Atmosphere Ocean (TAO) array\nwhich was developed by the international Tropical Ocean Global\nAtmosphere (TOGA) program. The TAO array consists of nearly 70 moored\nbuoys spanning the equatorial Pacific, measuring oceanographic and\nsurface meteorological variables critical for improved detection,\nunderstanding and prediction of seasonal-to-interannual climate\nvariations originating in the tropics, most notably those related to\nthe El Nino/Southern Oscillation (ENSO) cycles.\n\nThe moorings were developed by National Oceanic and Atmospheric\nAdministration's (NOAA) Pacific Marine Environmental Laboratory\n(PMEL). Each mooring measures air temperature, relative humidity,\nsurface winds, sea surface temperatures and subsurface temperatures\ndown to a depth of 500 meters and a few a of the buoys measure\ncurrents, rainfall and solar radiation. The data from the array, and\ncurrent updates, can be viewed on the web at the this address .\n\nThe data consists of the following variables: date, latitude,\nlongitude, zonal winds (west<0, east>0), meridional winds (south<0,\nnorth>0), relative humidity, air temperature, sea surface temperature\nand subsurface temperatures down to a depth of 500 meters. Data taken\nfrom the buoys from as early as 1980 for some locations. Other data\nthat was taken in various locations are rainfall, solar radiation,\ncurrent levels, and subsurface temperatures.\n\nVariable Characteristics\n\nThe latitude and longitude in the data showed that the bouys moved\naround to different locations. The latitude values stayed within a\ndegree from the approximate location. Yet the longitude values were\nsometimes as far as five degrees off of the approximate location.\n\nLooking at the wind data, both the zonal and meridional winds\nfluctuated between -10 m/s and 10 m/s. The plot of the two wind\nvariables showed no linear relationship. Also, the plots of each wind\nvariable against the other three meteorolgical data showed no linear\nrelationships.\n\nThe relative humidity values in the tropical Pacific were typically\nbetween 70% and 90%.\n\nBoth the air temperature and the sea surface temperature fluctuated\nbetween 20 and 30 degrees Celcius. The plot of the two temperatures\nvariables shows a positive linear relationship existing. The two\ntemperatures when each plotted against time also have similar plot\ndesigns. Plots of the other meteorological variables against the\ntemperature variables showed no linear relationship.\n\nThere are missing values in the data. As mentioned earlier, not all\nbuoys are able to measure currents, rainfall, and solar radiation, so\nthese values are missing dependent on the individual buoy. The amount\nof data available is also dependent on the buoy, as certain buoys were\ncommissioned earlier than others.\n\nAll readings were taken at the same time of day.\n\nOther Relevant Information\n\nBackground\n\nThe El Nino/Southern Oscillation (ENSO) cycle of 1982-1983, the\nstrongest of the century, created many problems throughout the world.\nParts of the world such as Peru and the Unites States experienced\ndestructive flooding from increased rainfalls while the western\nPacific areas experienced drought and devastating brush fires. The\nENSO cycle was neither predicted nor detected until it was near its\npeak. This highlighted the need for an ocean observing system (i.e.\nthe TAO array) to support studies of large scale ocean-atmosphere\ninteractions on seasonal-to-interannual time scales.\n\nThe TAO array provides real-time data to climate researchers, weather\nprediction centers and scientists around the world. Forcasts for\ntropical Pacific Ocean temperatures for one to two years in advance\ncan be made using the ENSO cycle data. These forcasts are possible\nbecause of the moored buoys, along with drifting buoys, volunteer ship\ntemperature probes, and sea level measurements.\n\nResearch Questions\n\nResearch questions of interest include:\n* How can the data be used to predict weather conditions throughout\nthe world?\n* How do the variables relate to each other?\n* Which variables have a greater effect on the climate variations?\n* Does the amount of movement of the buoy effect the reliability of\nthe data?\n\nWhen performing an analysis of the data, one should pay attention the\npossible affect of autocorrelation. Using a multiple regression\napproach to model the data would require a look at autoregression\nsince the weather statistics of the previous days will affect today's\nweather.\n\nData Format\n\nThe data is stored in an ASCII files with one observation per line.\nSpaces separate fields and periods (.) denote missing values.\n\nPast Usage\n\nThis data was used in the American Statistical Association Statistical\nGraphics and Computing Sections 1999 Data Exposition.\n\nReferences and Further Information\n\nMore information and data from the TAO array can be found at the\nPacific Marine Environmental Laboratory [4]TAO data webpage.\n\nInformation on storm data is available [5]here. This site contains\ndata from January 1994 to April 1998 in a chronological listing by\nstate provided by the National Weather Service. The data includes\nhurricanes, tornadoes, thunderstorms, hail, floods, drought\nconditions, lightning, high winds, snow, and temperature extremes.\n\nHurricane tracking data for the Atlantic is available [6]here. The\nsite contains a map showing the paths of the Atlantic hurricanes and\nalso includes the storms winds (in knots), pressure (in millibars),\nand the category of the storm based on Saffir-Simpson scale.\n\nAnother site of interest related to the ENSO cyles is available\n[7]here. This site contains information on twelve areas of the world\nthat have demonstrated ENSO-precipitation relationships. Included in\nthe site are maps of the areas and time series plots of actual daily\nprecipitation and accumulated normal precipitation for the areas.\n_________________________________________________________________\n\n\n[8]The UCI KDD Archive\n[9]Information and Computer Science\n[10]University of California, Irvine\nIrvine, CA 92697-3425\n\nLast modified: June 30, 1999\n\nReferences\n\n1. http://www.pmel.noaa.gov/\n2. http://www.public.iastate.edu/~dicook/\n3. mailto:dicook@iastate.edu\n4. http://www.pmel.noaa.gov/toga-tao/\n5. http://www.ncdc.noaa.gov/pdfs/sd/sd.html\n6. http://wxp.eas.purdue.edu/hur_atlantic/\n7. http://www.cpc.ncep.noaa.gov/products/analysis_monitoring/ensostuff/current_impacts/precip_accum.html\n8. http://kdd.ics.uci.edu/\n9. http://www.ics.uci.edu/\n10. http://www.uci.edu/\n\n\nInformation about the dataset\nCLASSTYPE: numeric\nCLASSINDEX: none specific", "creator": null, "contributor": null, "collection_date": null, "upload_date": "2014-10-03T21:52:52", "language": null, "license": "Public", "default_target_attribute": "s_s_temp", "row_id_attribute": null, "ignore_attribute": null, "tags": "uci", "features": [{"index": 0, "name": "buoy", "data_type": "nominal", "nominal_values": ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47", "48", "49", "50", "51", "52", "53", "54", "55", "56", "57", "58", "59"], "number_missing_values": 0}, {"index": 1, "name": "day", "data_type": "nominal", "nominal_values": ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"], "number_missing_values": 0}, {"index": 2, "name": "latitude", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 3, "name": "longitude", "data_type": "numeric", "nominal_values": null, "number_missing_values": 0}, {"index": 4, "name": "zon_winds", "data_type": "numeric", "nominal_values": null, "number_missing_values": 105}, {"index": 5, "name": "mer_winds", "data_type": "numeric", "nominal_values": null, "number_missing_values": 105}, {"index": 6, "name": "humidity", "data_type": "numeric", "nominal_values": null, "number_missing_values": 158}, {"index": 7, "name": "air_temp", "data_type": "numeric", "nominal_values": null, "number_missing_values": 98}, {"index": 8, "name": "s_s_temp", "data_type": "numeric", "nominal_values": null, "number_missing_values": 73}], "qualities": null}